package com.example.zun.hardcoded;

import android.content.ContentValues;
import android.content.Context;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;

public class AppDataBase extends SQLiteOpenHelper {
    public static final String DB_NAME = "appdatabase";
    public static final int DB_VERSION = 8;

    public AppDataBase(Context context) {
        super(context, DB_NAME, null, DB_VERSION);
    }

    @Override
    public void onCreate(SQLiteDatabase sqLiteDatabase) {
        sqLiteDatabase.execSQL("create table themes(" +
                "id INTEGER primary key autoincrement," +
                "theme text not null," +
                "man INTEGER," +
                "story text not null )");


        insertThemes(sqLiteDatabase);
    }

    private void insertThemes(SQLiteDatabase sqLiteDatabase) {
        ContentValues cv = new ContentValues();
        cv.put("theme", "Как ухаживать за комнатными растениями?");
        cv.put("man", 0);
        cv.put("story", "1.Большинство комнатных растений размещает ближе к свету." +
                "2.Поливают растения отстоявшейся водой комнатной температуры. Летом поливают ежедневно вечером, зимой - реже по утрам. Лейку держат сбоку, чтобы струя воды не вымывала почву." +
                "3.Рыхлят палочкой поверхность почвы в горшочке, чтобы к корням поступал воздух. Рыхлить надо осторожно, чтобы не повредить корни растения." +
                "4.Вытирают пыль с листьев влажной тряпкой, губкой или кисточкой." +
                "5.Растения регулярно опрыскивают водой комнатной температуры." +
                "6.Осторожно срезать с растений сухие листья и веточки. Следить за чистотой цветочных горшков и подставок.");
        sqLiteDatabase.insert("themes", null, cv);

        cv = new ContentValues();
        cv.put("theme", "Уход за волосами");
        cv.put("man", 0);
        cv.put("story", "1.Подбирать средства для волос надо правильно. От природы у каждого из нас разные волосы, в зависимости от этого под каждый тип волос производится специальная косметика: шампуни, бальзамы и так далее. Важно смотреть, для какого типа волос, то средство, которое вы покупаете." +
                "2.После шампуня обязательно наносите на волосы бальзам и/или маску. Бальзамы питают и восстанавливают структуру стержня волоса, укрепляют его, делая эластичным. Благодаря склеиванию чешуек, они облегчают процесс расчесывания. Если у вас жирные волосы, не стоит наносить бальзамы и маски на корни волос, чтобы сохранить чистоту и свежеть волос более длительное время. Достаточно будет наносить бальзам на ¾ всей длины.(На усмотрение родителей)." +
                "3.Мойте волосы теплой водой: 36-37 градусов, чтобы не повредить структуру волоса. После мытья сполосните голову прохладной водой – это поможет разгладить кутикулу волос и сделает их послушнее." +
                "4.Не стоит слишком часто мыть голову. так как это может привести к истощению, ломкости волоса и активизации сальных желез. Следите за своими волосами и промывайте их только по необходимости." +
                "5.Вопреки распростертым советам расчесывать мокрые волосы не стоит, это может поломать волос или вырвать его с корнем." +
                "6.Заворачивать мокрые волосы в полотенце тюрбаном – не самое полезное. Это нарушает кровообращение и питание кожи головы." +
                "7.Витамины необходимы для здоровья волос. Для того, чтобы получать необходимое количество витаминов, следите за своим рационом питания. Добавьте в меню лосось, поскольку там витамин D и омега-3 жирные кислоты, а также грецкие орехи, так как в них витамин Е и медь, помогающая сохранить блеск волос. В рацион стоит также включить: сладкий картофель, яйца, шпинат, чечевицу, творог, чернику и птицу. Во всех этих продуктах целая азбука различных полезных элементов: минералов и витаминов, которые вместе с косметическими средствами, помогут вашим волосам оставаться красивыми и шелковистыми.");
        sqLiteDatabase.insert("themes", null, cv);

        cv = new ContentValues();
        cv.put("theme", "Как гладить одежду?");
        cv.put("man", 2);
        cv.put("story","Способы глажки" + "1.Сухой: Таким способом гладят вещи с изнаночной или лицевой стороны. 2.С увлажнением: Изделие сбрызгивают водой или заворачивают во влажное полотенце, а затем проглаживают горячим утюгом." +
                "Разные ткани требуют определённой температурной обработки, уровня увлажнения и способа разглаживания, поэтому обязательно читайте информацию на этикетке. Синтетические ткани можно обрабатывать только тёплым утюгом с использованием влажной марли для отдельных участков изделия. Лучше всего проглаживать синтетику через подкладочное полотно. Шёлк необходимо увлажнить перед проглаживанием, предварительно завернув изделие на полчаса в мокрую ткань. Ни в коем случае не стоит сбрызгивать шёлковую вещь: впоследствии водяные капли могут проявиться как безобразные пятна. Тёмный шёлк гладьте через тонкую ткань с изнаночной стороны, а вот светлые вещи лучше гладить с лицевой. Подкладочные ткани (сатин, саржа, шёлк) необходимо гладить с изнаночной стороны без увлажнения, чтобы не потерять блеск и не оставить пятен от воды. Джерси лучше всего гладить через влажную марлю или полотно с использованием тёплого утюга. Помните, что этот материал хорошо растягивается. Поэтому старайтесь не деформировать вещь резкими движениями утюга. Шёлк-сырец используется при пошиве портьерных и декоративных изделий. Такой материал проглаживается в увлажнённом состоянии с изнанки очень горячим утюгом. Искусственный шёлк. После стирки лучше всего завернуть в материал, хорошо впитывающий влагу. Гладить надо с изнанки умеренно нагретым утюгом. Махровые изделия не стоит гладить, чтобы сохранить их мягкость и способность хорошо впитывать влагу. Шерсть быстро садится, поэтому изделия из неё утюжат только через влажную ткань с изнаночной стороны при температуре 150–165 °С, аккуратно прикладывая утюг. Если шерстяные вещи при стирке дали усадку, их увлажняют, опрыскивая водой, дают им отлежаться и гладят через тряпку, вытягивая до нужных размеров." +
                "Как гладить брюки? Начните гладить с изнанки. Отутюжьте все швы, подкладку и карманы. Выверните брюки на лицевую сторону и через увлажнённую марлю разгладьте верхнюю часть вещи и пояс, переставляя и прижимая утюг. Для удобства выверните карманы.Сложите брюки так, чтобы боковые и внутренние швы совпадали. Сначала прогладьте внутренние стороны брючин, а затем — внешние, хорошо загладив складки. Заутюжьте стрелки. Прижмите утюгом разложенную штанину вверху и внизу, а затем прогладьте оставшуюся часть между этими точками. Чтобы стрелки сохранялись дольше, изнутри их прочерчивают мылом, а снаружи проглаживают через марлю, слегка смоченную уксусом. При этом стрелку простукивают щёткой. Залоснившиеся участки брюк необходимо прогладить, предварительно залив в утюг раствор из одной части воды и двух частей уксуса. Если брюки вытянулись на коленях, деформированные участки нужно хорошенько увлажнить, а после накрыть куском льна и сутюжить ткань до исчезновения пузырей, слегка прикладывая к ним сильно нагретый утюг. Сутюживание нужно начинать с краёв участка, перемещаясь к его середине." +
                "Как гладить рубашку? Увлажните рубашку и приготовьте хорошо прогретый утюг. Начните гладить с воротника, выпрямив и отутюжив его сначала с внутренней стороны, а потом с внешней. Рубашки из шерсти, с вышивкой или с отливом нужно гладить влажными и обязательно с изнанки. Так вы сохраните первоначальную красоту вещи и избавитесь от нежелательного блеска. Погладьте манжеты с обеих сторон, предварительно расстегнув и расправив их на гладильной доске. Затем переходите к разглаживанию рукавов, пол и спинки." +
                "Как гладить платье и юбку? У платья в первую очередь необходимо отгладить верхнюю часть (вырез, воротник, плечи), во вторую — подол. Глажение юбки начинается с обработки карманов, пояса и верхней части изделия. Затем проглаживают швы, молнию, основную часть и низ изделия. Ткань необходимо гладить поперёк, а затем вдоль, расправляя кончиком утюга образовавшиеся складки. Вертикальные вытачки заутюживаются к середине, а грудные — вниз. Чтобы изделия с гофре и плиссе не потеряли форму, перед стиркой тонкой ниткой свободными стежками прометайте края всех складок. После стирки просушите вещи на вешалке, расправив и потянув в нужном направлении складки. У изделия из толстой ткани подол необходимо гладить крайне аккуратно, не вытягивая ткань и слегка отпаривая место подшивки." +
                "Как гладить особо нежные изделия? Перед стиркой кружево пришивают крупными стежками к куску белой ткани, затем стирают, крахмалят и, не дав высохнуть, проглаживают носиком утюга. Важно знать, какие нити входят в состав кружева. Например, ажурные вещи из хлопчатобумажных ниток гладят с изнаночной стороны через мокрую ткань. А вот синтетическое кружево перенесёт только тёплый утюг. Тонкое шёлковое бельё не гладят. Галстуки тоже не рекомендуется утюжить. Освежить внешний вид изделия можно, расправив и обернув его вокруг банки с кипятком." );
        sqLiteDatabase.insert("themes", null, cv);
        cv = new ContentValues();
        cv.put("theme", "Как завязывать галстук?");
        cv.put("man", "1");
        cv.put("story", "Самый популярный и простой способ завязать галстук – четверка или четвертной. В некоторых семьях навыки, как завязывать этот узел, передают из поколения в поколение, от отца к сыну. При всех плюсах легкости этой техники, есть один небольшой минус – выделиться из толпы с таким узлом точно не получится. Но в таком случае всегда можно выбрать галстук с интересной фактурой, рисунком или сочетанием цветов." +
                "\n Здесь вы можете подробно ознакомиться со многими способами завязки галстука :" +
                "https://www.elle.ru/moda/fashion-blog/18-sposobov-zavyazat-galstuk/");
        sqLiteDatabase.insert("themes", null, cv);

        cv = new ContentValues();
        cv.put("theme", "Как забить гвоздь?");
        cv.put("man", "1");
        cv.put("story", "1.Новичкам лучше всего держать гвоздь пассатижами или прищепкой, чтобы не попасть по пальцам." +
                "2.Поднесите гвоздь к поверхности, в которую хотите забить гвоздь, для точности можно сделать отметку на ней." +
                "3.Быстрыми, резкими ударами забить гвоздь молотком (если на гвоздь нужно что-то повесить, то забивать гвоздь необходимо не до конца).");
        sqLiteDatabase.insert("themes", null, cv);

        cv = new ContentValues();
        cv.put("theme", "Как правильно мыть полы?");
        cv.put("man", "2");
        cv.put("story", "Начиная уборку, максимально освободите пространство. Уберите все лишние предметы, которые находятся на полу. Легкую мебель можно сдвинуть, а небольшие коврики свернуть в рулон.\n" +
                "Протрите подоконники, столы, технику и другие поверхности, на которых может скапливаться пыль.\n" +
                "Проведите предварительную сухую уборку. Для этого можно использовать пылесос или специальный моп для сухого сбора пыли.  Сухая уборка значительно сократит время мытья пола и повысит качество чистоты убираемой поверхности." +
                "1.Наберите в ведро теплой воды, добавьте моющее средство. Возьмите ведро и наберите в него достаточно воды, чтобы полностью погружать моющую часть швабры. Затем налейте в ведро немного средства для посуды или яблочного уксуса, отбеливателя, нашатырного спирта или другого похожего моющего средства. Как правило, достаточно наливать около 120 мл моющего средства на 4 литра воды.[4] Прежде чем попробовать какое-либо новое моющее средство, внимательно прочитайте информацию на этикетке, чтобы оно точно подходило для вашего пола. Не на всех упаковках это указано, но поищите на этикетке рекомендации о том, в какой пропорции с водой нужно использовать выбранное вами средство." +
                "2.Погрузите швабру в ведро с моющим раствором. Опустите швабру в ведро и дайте ей намокнуть. Если швабра очень сухая, может потребоваться несколько минут, чтобы она намокла." +
                "3. Поднимите швабру и дайте стечь лишней воде. Как только швабра достаточно намокнет, поднимите ее и подержите над ведром. Обычно швабра набирает гораздо больше воды, чем нужно, так что подержите ее над ведром 2–3 секунды, чтобы лишняя вода стекла в ведро.[5] Если хотите, можно выжать швабру, чтобы убрать лишнюю воду." +
                "4. Мойте пол небольшими участками. Чтобы смыть как можно больше грязи, перемещайте швабру каждый раз на расстояние 10–15 см. Так вы распределите моющее средство по большей площади пола." +
                "5.Продвигайтесь к двери. Так вы точно не наступите на только что вымытые участки пола. Если вы все же наступили на мокрый пол, пройдитесь по этому месту шваброй еще раз, чтобы убрать отпечаток своей подошвы. В узких проходах (коридор, прихожая) сначала помойте по бокам, а затем центр прохода." +
                "6.Выжмите швабру, когда закончите с уборкой. Как только вы тщательно вымоете пол, возьмите швабру так, чтобы она находилась над ведром и выжмите моющую насадку руками. продолжайте выжимать швабру, пока в ней почти не останется воды. К некоторым швабрам и ведрам в комплекте идет приспособление для выжимания, с которым не нужно выжимать швабру вручную." +
                "7.Пройдитесь шваброй по полу, чтобы убрать грязную воду. Протрите шваброй каждый помытый участок пола 3–4 раза. Переборщите — и просто начнете размазывать грязную воду по полу. После каждого участка отжимайте швабру, чтобы убрать впитанную ей воду. Возможно, вам понадобится повторить эти действия несколько раз, чтобы полностью высушить полы." );
        sqLiteDatabase.insert("themes", null, cv);

        cv = new ContentValues();
        cv.put("theme", "Как сварить суп?");
        cv.put("man", "0");
        cv.put("story", "Продукты: Свинина (лопаточная или шейная часть) - 500 г.\n" +
                " Капуста белокочанная - 500 г.\n" +
                "Картофель - 2 шт.\n" +
                "Морковь - 1 шт.\n" +
                "Лук репчатый - 1-2 шт.\n" +
                "Томатная паста - 1 ст. ложка.\n" +
                "Помидоры свежие - 2 шт.\n" +
                "Масло растительное - 2 ст. ложки.\n" +
                "Зелень - 0,5 пучка.\n" +
                "Лавровый лист - 1-2 шт.\n" +
                "Чеснок (по желанию) - 2-4 зубчика (по вкусу).\n" +
                "Перец молотый - 1 щепотка (по вкусу).\n" +
                "Соль - 0,5-1 ст. ложка (по вкусу).\n" +
                "Вода - 2-2,5 л.\n" +
                "Сметана (для подачи) - 100 г." +
                "1.Подготовить продукты." +
                "2.Мясо вымыть, залить в кастрюле холодной водой. Поставить кастрюлю на огонь, довести воду до кипения, снять шумовкой пену." +
                "3.Уменьшить огонь до малого, накрыть кастрюлю крышкой. Варить бульон до готовности свинины (около часа). Отварное мясо затем можно вынуть, нарезать кусочками и добавить в суп." +
                "4.Пока варится мясо, подготовить овощи. Морковь очистить, натереть на крупной терке. Лук очистить и нарезать мелкими кубиками." +
                "5.Разогреть сковороду, налить растительное масло. В горячее масло выложить лук и морковь. Обжаривать овощи на среднем огне (пассеровать) 2-3 минуты." +
                "6.Добавить томатную пасту.(Если используются свежие помидоры, нарезать их или натереть на тёрке и добавить к моркови с луком.)" +
                "7.Перемешать и готовить овощи еще 5-7 минут, помешивая." +
                "8.Картофель почистить, нарезать небольшим кубиком (произвольными кусочками). Капусту нарезать квадратиками или соломкой." +
                "9.В бульон выложить капусту, картошку и довести до кипения. Вместе с картофелем добавлять только зрелую капусту, молодую капусту следует класть в суп минут за 7 до окончания" +
                "10.Добавить в суп зажарку (пассеровку). Варить щи из свежей капусты при слабом кипении 15-20 минут." +
                "11.Зелень мелко нарезать.Чеснок (если используется) почистить, раздавить с солью." +
                "12. В конце приготовления супа добавить молотый перец, лавровый лист и, при желании, растертый чеснок с солью.\n" +
                "Добавить зелень и снять кастрюлю с огня. Дать супу настояться минут 10-15." +
                "13.Подавать щи со сметаной. Приятного аппетита!" +
                "");
        sqLiteDatabase.insert("themes", null, cv);

        cv = new ContentValues();
        cv.put("theme", "Как вкрутить лампочку?");
        cv.put("man", "1");
        cv.put("story", "1) Выбор лампочки: Прежде чем выбирать новую лампочку необходимо выкрутить старую и посмотреть на ее тип и мощность, которые нужно запомнить, а лучше записать на бумажке.\n" +
                "Перед тем как выкрутить лампочку обесточьте её, для этого выключите свет.\n" +
                "Встаньте на стремянку, стул, чтобы достать до самой лампы. Чтобы открутить перегоревшую лампочку, необходимо посмотреть, как она расположена. Если она находится внутри плафона и руками ее невозможно достать, сначала снимите плафон.\n" +
                "2)Возьмите сухое полотенце, оберните им лампочку и начинайте выкручивать против часовой стрелки. Сильно не надавливайте, иначе лампочка может лопнуть. Если она откручивается вместе с патроном, все равно продолжайте откручивать. Затем открутите патрон от лампочки и верните его на место. Бывает, лампочка взорвалась, и в патроне остался только патронник, то есть металлическая резьба от лампочки. Пассатижами схватите за край резьбы и начинайте выкручивать." +
                "3) О вкручивании лампы повествование: Итак, на данный момент Вы уже сняли старую лампу.  Дальше нужно просто аккуратно всунуть лампочку в патрон и немного надавливая закрутить по часовой стрелке. Если же лампочка не подошла под патрон, то необходимо поменять ее на аналог с подходящим цоколем. Внимание, придерживайтесь техники безопасности и внимательно читайте инструкцию перед установкой необходимой лампы.");
        sqLiteDatabase.insert("themes", null, cv);

        cv = new ContentValues();
        cv.put("theme", "Как стирать бельё?");
        cv.put("man", "2");
        cv.put("story", "Что то");
        sqLiteDatabase.insert("themes", null, cv);

        cv = new ContentValues();
        cv.put("theme", "Уход за одеждой");
        cv.put("man", "0");
        cv.put("story", "ничего");
        sqLiteDatabase.insert("themes", null, cv);

        cv = new ContentValues();
        cv.put("theme", "Как повесить полку?");
        cv.put("man", "1");
        cv.put("story", "Не знаю");
        sqLiteDatabase.insert("themes", null, cv);

    }


    @Override
    public void onUpgrade(SQLiteDatabase sqLiteDatabase, int i, int i1) {
        sqLiteDatabase.execSQL("drop table themes;");
        onCreate(sqLiteDatabase);
    }
}